Good evening @kponichtera,

I was able to reproduce the issue you are facing and had a first look into the source code.
Can I ask you to try something out? If it's working it unblocks you until a proper fix in the provider is in place.

In your current example you have

```hcl
exclusion_rules {
  amis {
    last_launched {
      unit  = "WEEKS"
      value = 1
    }
  }
}
```


and for me - using the same provider version - below works

```hcl
exclusion_rules {
   amis {
     is_public = false
     last_launched {
       unit  = "WEEKS"
       value = 1
     }
   }
 }
```

The only difference here is that `is_public` is explicitly set. Can you try adding `is_public =true resp. false`? 

Below is the complete output of my `terraform apply` - had to create IAM role and permissions in addition to the lifecycle policy.

```shell
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.image_lifecycle_execution will be created
  + resource "aws_iam_role" "image_lifecycle_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "imagebuilder.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "image_lifecycle_execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.image_lifecycle_permissions will be created
  + resource "aws_iam_role_policy" "image_lifecycle_permissions" {
      + id          = (known after apply)
      + name        = "image-lifecycle-delete"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DeregisterImage",
                          + "ec2:DeleteSnapshot",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAmiAndSnapshotDeletion"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.example will be created
  + resource "aws_iam_role_policy_attachment" "example" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/EC2ImageBuilderLifecycleExecutionPolicy"
      + role       = "image_lifecycle_execution"
    }

  # aws_imagebuilder_lifecycle_policy.default will be created
  + resource "aws_imagebuilder_lifecycle_policy" "default" {
      + arn            = (known after apply)
      + description    = "Lifecycle policy for removing old images, AMIs and snapshots"
      + execution_role = (known after apply)
      + id             = (known after apply)
      + name           = "name"
      + region         = "eu-central-1"
      + resource_type  = "AMI_IMAGE"
      + status         = "ENABLED"
      + tags_all       = {}

      + policy_detail {
          + action {
              + type = "DELETE"

              + include_resources {
                  + amis       = true
                  + containers = (known after apply)
                  + snapshots  = true
                }
            }
          + exclusion_rules {
              + amis {
                  + is_public = false

                  + last_launched {
                      + unit  = "WEEKS"
                      + value = 1
                    }
                }
            }
          + filter {
              + type  = "COUNT"
              + value = 1
            }
        }

      + resource_selection {
          + tag_map = {
              + "TerraformBuiltCustomImage" = "name"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_role.image_lifecycle_execution: Creating...
aws_iam_role.image_lifecycle_execution: Creation complete after 2s [id=image_lifecycle_execution]
aws_iam_role_policy_attachment.example: Creating...
aws_iam_role_policy.image_lifecycle_permissions: Creating...
aws_imagebuilder_lifecycle_policy.default: Creating...
aws_iam_role_policy_attachment.example: Creation complete after 1s [id=image_lifecycle_execution/arn:aws:iam::aws:policy/service-role/EC2ImageBuilderLifecycleExecutionPolicy]
aws_iam_role_policy.image_lifecycle_permissions: Creation complete after 2s [id=image_lifecycle_execution:image-lifecycle-delete]
aws_imagebuilder_lifecycle_policy.default: Creation complete after 2s [id=arn:aws:imagebuilder:eu-central-1:<redacted>:lifecycle-policy/name]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```